<a href="https://colab.research.google.com/github/dubeyshubham786/Python_libraries/blob/main/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Selecting rows and Columns

In [ ]:
# Importing pandas as pd

import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [ ]:
# Read the csv file

df = pd.read_csv('/content/gdrive/MyDrive/Colab Notebooks/Github/Pandas/imdb_data.csv')

In [ ]:
df.head()

   id  ...   revenue
0   1  ...  12314651
1   2  ...  95149435
2   3  ...  13092000
3   4  ...  16000000
4   5  ...   3923970

[5 rows x 23 columns]

In [ ]:
df

        id  ...    revenue
0        1  ...   12314651
1        2  ...   95149435
2        3  ...   13092000
3        4  ...   16000000
4        5  ...    3923970
...    ...  ...        ...
2995  2996  ...    1596687
2996  2997  ...     180590
2997  2998  ...   89456761
2998  2999  ...  171963386
2999  3000  ...   82087155

[3000 rows x 23 columns]

In [ ]:
# Creating dataframe from dictionary

person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}



people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}


people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [ ]:
people['email']

# We get the list of emails of the people

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [ ]:
# We can create dataframe 

df = pd.DataFrame(people)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
# Accessing values of a dataframe

df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [ ]:
type(df['email'])

pandas.core.series.Series

In [ ]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [ ]:
# TO get columns we can do like this

df.columns

Index(['first', 'last', 'email'], dtype='object')

In [ ]:
# To get the first row 
# Remember that in iloc we are searching by integer locations
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [ ]:
# Similarly if we want first and second row

df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [ ]:
# if we want required column lets say we want email's first two column values

df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
# We can also use loc function
# loc function uses labels values

df.loc[[0, 1], 'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [ ]:
# Similarly if we want last name and email we can pass a list of string

df.loc[[0, 1], ['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com

## Now Let's do pandas operations on csv files

In [ ]:
# To get the shape of the file

df.shape

# 3000 rows and 23 columns

(3000, 23)

In [ ]:
# To get the total number of columns 

df.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

In [ ]:
# If we want title columns list

df['title']

0                         Hot Tub Time Machine 2
1       The Princess Diaries 2: Royal Engagement
2                                       Whiplash
3                                        Kahaani
4                                     Marine Boy
                          ...
2995                                     Chasers
2996                            We Are the Best!
2997                     The Long Kiss Goodnight
2998                            Along Came Polly
2999                                   Abduction
Name: title, Length: 3000, dtype: object

In [ ]:
# similaly for spoken language

df['original_language']

0       en
1       en
2       en
3       hi
4       ko
        ..
2995    en
2996    sv
2997    en
2998    en
2999    en
Name: original_language, Length: 3000, dtype: object

In [ ]:
# To count how many films used english language and so on 
# We can use value_counts function to do that

df['original_language'].value_counts()

# Here we can see that english used in 2575 films similarly french in 78 movies and so on

en    2575
fr      78
ru      47
es      43
hi      42
ja      37
it      24
ko      20
cn      20
zh      19
de      18
ta      16
sv       8
nl       6
pt       6
da       5
fa       5
ro       4
tr       3
hu       3
pl       2
ml       2
no       2
te       2
fi       2
nb       1
ur       1
id       1
ar       1
vi       1
el       1
cs       1
mr       1
bn       1
he       1
sr       1
Name: original_language, dtype: int64

In [ ]:
# To get the first rows we can use loc and iloc 
# Here label is 0 so we have used label as integer value in loc function

df.loc[0]

# This is the information of the first rows

id                                                                       1
belongs_to_collection    [{'id': 313576, 'name': 'Hot Tub Time Machine ...
budget                                                            14000000
genres                                      [{'id': 35, 'name': 'Comedy'}]
homepage                                                               NaN
imdb_id                                                          tt2637294
original_language                                                       en
original_title                                      Hot Tub Time Machine 2
overview                 When Lou, who has become the "father of the In...
popularity                                                         6.57539
poster_path                               /tQtWuwvMf0hCc2QR2tkolwl7c3c.jpg
production_companies     [{'name': 'Paramount Pictures', 'id': 4}, {'na...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                       2/20/15
runtime                                                                 93
spoken_languages                  [{'iso_639_1': 'en', 'name': 'English'}]
status                                                            Released
tagline                  The Laws of Space and Time are About to be Vio...
title                                               Hot Tub Time Machine 2
Keywords                 [{'id': 4379, 'name': 'time travel'}, {'id': 9...
cast                     [{'cast_id': 4, 'character': 'Lou', 'credit_id...
crew                     [{'credit_id': '59ac067c92514107af02c8c8', 'de...
revenue                                                           12314651
Name: 0, dtype: object

In [ ]:
# Similarly if we want to see a particular column in the rows 
# lets say we want to see the title column of the first rows

df.loc[0, 'title']

# Note here that we have used label title to get the values

'Hot Tub Time Machine 2'

In [ ]:
# If we want title of the first 3 rows 

df.loc[[0, 1, 2], 'title']

0                      Hot Tub Time Machine 2
1    The Princess Diaries 2: Royal Engagement
2                                    Whiplash
Name: title, dtype: object

In [ ]:
# We can do this by using list slicing 

df.loc[0:2, 'title']

# Note here that slicing values is inclusive here

0                      Hot Tub Time Machine 2
1    The Princess Diaries 2: Royal Engagement
2                                    Whiplash
Name: title, dtype: object

In [ ]:
# If we want column values from title to revenue then

df.loc[0:2, 'title':'revenue']

                                      title  ...   revenue
0                    Hot Tub Time Machine 2  ...  12314651
1  The Princess Diaries 2: Royal Engagement  ...  95149435
2                                  Whiplash  ...  13092000

[3 rows x 5 columns]

# You can see the documnetation of pandas library by clicking [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)